import NavPage from '../../../src/nav';
import { React } from 'webpkit/mobile';
import Header from '../../../src/util/header';

import "./index.scss";


class Agreement extends NavPage {
	render() {
		return <div className="agreement_box">
			<Header page={this} title='Hashii隐私协议' />

			<div className="agree_box">

				<p>为切实保护Hashii用户个人信息，优化用户体验，Hashii（以下或称“我们”，指星矿科技（北京）有限公司）根据现行法规及政策，制定Hashii“隐私政策”（“本政策”）。 本政策将详细说明Hashii在获取、管理及保护用户个人信息方面的政策及措施。本政策适用于Hashii向你提供的所有服务，无论你是通过计算机设备、移动终端还是其他设备获得的Hashii服务。在您开始使用我们的产品/服务前，请您务必仔细阅读和理解本政策，<b>特别应重点阅读我们以粗体标识的条款，以确保您充分理解和同意后再开始使用。</b> 本政策中涉及的专业词汇，我们尽量以简明通俗的语言向您解释，以便于您理解。</p>
				<p> &nbsp;&nbsp;&nbsp;&nbsp; <b>您同意本隐私政策即表示您已知悉Hashii产品/服务的功能及其所需收集和使用的必要个人信息，并同意给予相应的收集和使用的授权,但并不代表您已同意开启附加功能、处理非必要个人信息；对于附加功能、非必要个人信息以及敏感个人信息的处理，我们将根据实际情况由您主动开启、提供或单独征求您的同意，同时您也可通过本隐私政策释明的方式管理上述个人信息或权限。</b> 如你对于本政策或相关事宜有任何问题，你可随时通过访问Hashii在线客服系统、Hashii官方服务账号或拨打我们的任何一部客服电话等多种方式与我们联系。</p>

				<p>
					<div>本政策将帮助你了解以下内容：</div>
					<div>一、个人信息的收集</div>
					<div>二、对 Cookie 和web beacon的使用</div>
					<div>三、个人信息的使用</div>
					<div>四、个人信息的保护和安全措施</div>
					<div>五、个人信息的存储</div>
					<div>六、个人信息的共享、转让、公开披露</div>
					<div>七、个人信息的管理</div>
					<div>八、对未成年人个人信息的特别保护</div>
					<div>九、隐私政策的修改</div>
					<div>十、争议解决</div>
					<div>十一、其他</div>
				</p>

				<p>
					<b> &nbsp;&nbsp;&nbsp;&nbsp; 本政策是你使用Hashii服务及各项功能的基础性法律文件，我们希望你在使用Hashii服务前仔细阅读并明确你已经充分理解、接受本政策的内容，希望你可以根据自己的理解做出合适的选择。我们努力通过通俗的语言表述本政策中涉及的相关术语，并提供进一步说明的链接，以便你更好地理解。在我们更新本政策后（我们会及时提示你更新的情况）你继续使用我们的产品与/或服务，即意味着你同意本政策(含更新版本)内容，并且同意我们按照本政策收集、使用、保存和共享你的相关信息。</b>
				</p>
				<p>
					本政策涉及的个人信息包括：个人基本信息（包括个人姓名、生日、性别、住址、个人电话号码、电子邮箱）；个人身份信息（包括身份证、军官证、护照、驾驶证、相关身份证明等）；个人位置信息；网络身份标识信息（包括系统账号、IP地址、邮箱地址及与前述有关的密码、密保）；通讯录；个人上网记录（包括搜索记录、软件使用记录、点击记录）；个人常用设备信息（包括硬件型号、设备MAC地址、操作系统类型、软件列表、唯一设备识别码（如IMEI/android ID/IDFA/OPENUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息）。
				</p>

				<p>
					<b>
						&nbsp;&nbsp;&nbsp;&nbsp; 个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息，本政策中涉及的个人敏感信息包括：个人身份信息（包括身份证、军官证、护照、驾驶证、户口本，相关身份证明等）；网络身份识别信息（包括账户名、账户昵称、邮箱地址及与前述有关的密码与密码保护问题和答案）；其他信息（包括通讯录、个人电话号码、手机号码、行程信息、网页浏览记录、精准定位信息、银行账户）。
					</b>
					对于个人敏感信息，我们将在本政策中进行显著标识，请您注意仔细阅读。
				</p>

				<p>
					<b>一、个人信息的收集</b>
					<b>
						&nbsp;&nbsp;&nbsp;&nbsp;你已知悉且同意，在你注册Hashii账号或使用Hashii提供的服务时，Hashii将记录你提供的相关个人信息，如：密码、手机号码等，上述个人信息是你获得Hashii提供服务的基础。同时，基于优化用户体验之目的，Hashii会获取与提升Hashii服务有关的其他信息，例如当你访问Hashii时，我们可能会收集我们各类服务的受欢迎程度、浏览器软件信息等以便优化我们的服务。
					</b>
					<div>
						&nbsp;&nbsp;&nbsp;&nbsp;在你使用Hashii前，我们会引导你阅读本政策，并在你接受本政策的基础上，获得你的相关个人信息。如果你不同意提供个人信息，你将无法使用Hashii的全部或部分功能和服务，或无法获得更个性化的功能，或无法参加某些活动，或无法收到我们的通知等。
					</div>
					<div>
						<b>&nbsp;&nbsp;&nbsp;&nbsp;1、Hashii仅会在出现下列情况时收集你的个人信息：</b>
					</div>
					<div>
						<b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;（1）在你注册Hashii账号时，我们会收集你的账户昵称、性别、密码、密码保护选项、电子邮箱、手机号码、出生年月/年龄信息。</b> 若你以其他方式关联登陆Hashii，我们会向关联第三方请求你的个人信息，对于我们要求但第三方无法提供的个人信息，我们仍可以要求你提供。
					</div>
					<div>
						<b>
							&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;（2）当你在Hashii中使用第三方提供的服务时，你需要允许第三方收集你的订单信息、支付信息等，如果你拒绝第三方在提供服务时收集此类信息，将可能会导致你无法在Hashii中使用第三方服务。
						</b>
					</div>
					<div>
						2、基于对你信息的有效保护，我们会对收集到的你的信息进行去标识化处理，以保护你的信息安全。<b>在此希望你了解并接受，在对收集到的你的信息进行去标识化处理、不会透露你个人信息的前提下，Hashii有权对经过去标识化处理的你的信息进行分析并予以商业化的利用。</b>
					</div>
					<div>
						<b>3、当你通过Hashii登录第三方应用时，第三方可能会通过Hashii获得你的个人昵称、头像等信息。</b> 如果你拒绝向第三方提供此类信息，你可以在Hashii相关设置中关闭，关闭路径：。
					</div>
					<div>
						4、当涉及国家安全与利益、社会公共利益、与犯罪侦查有关的相关活动，或者涉及你或他人生命财产安全但在特殊情况下无法获得你的及时授权，以及能够从其他合法公开的渠道获取或法律法规规定的其他情形下，Hashii可能在不经过你的同意或授权的前提下，收集你的个人信息。
					</div>
					<div>
						<b>	5、Hashii如在上述场景之外获得你的个人信息，将重新征得你的明示同意，并在获得你明示同意前向你充分说明应用场景与获取你相关信息的内容与范围。</b>
					</div>
				</p>

				<p>
					<b>	二、对Cookie的使用</b>
					<div>
						&nbsp;&nbsp;&nbsp;&nbsp;Cookie可以帮助网站辨认注册用户，计算用户数量，通常被各网站用来判定完成注册的用户是否已经实现登录。Hashii承诺，对cookie信息的研究仅用于提升服务/产品质量及优化用户体验之目的。同时，如你不希望个人信息保留在cookie中，你可以对浏览器进行配置：选择"拒绝cookie"或"当网站发送cookie时通知你"，你应当知道，鉴于Hashii的服务是通过支持cookie来实现的，完成关闭cookie的操作后，可能影响到你访问Hashii或不能充分取得Hashii的服务。你不禁用cookie时，可能会得到提示，是否在下一次进入此网站时保留用户信息以便简化登录手续（如一键登录）。
					</div>
				</p>

				<p>
					<b>三、个人信息的使用</b>
					为了向你提供更好的服务或产品，Hashii会在下述情形使用你的个人信息：
					<div>（1）根据相关法律法规的要求；</div>
					<div>（2）根据你的授权；</div>
					<div>（3）根据Hashii相关服务条款、应用许可使用协议的约定。</div>
				</p>

				<p>
					四、个人信息的保护和安全措施
					<div>1、Hashii将尽一切合理努力保护我们获得的用户个人信息，并由专门的数据安全部门对个人信息进行保护。为防止用户个人信息在意外的、未经授权的情况下被非法访问、复制、修改、传送、遗失、破坏、处理或使用，Hashii已经并将继续采取以下措施保护你的个人信息：</div>
					<div>
						&nbsp;&nbsp;&nbsp;&nbsp;（1）我们的网络服务采取了传输层安全协议等加密技术，通过https等方式提供浏览服务，确保用户数据在传输过程中的安全。
					</div>
					<div>&nbsp;&nbsp;&nbsp;&nbsp;（2）通过采取加密技术对用户个人信息进行加密保存，并通过隔离技术进行隔离。</div>
					<div>&nbsp;&nbsp;&nbsp;&nbsp;（3）在个人信息使用时，例如个人信息展示、个人信息关联计算时，我们会采用包括内容替换、加密脱敏等多种数据脱敏技术增强个人信息在使用中的安全性。</div>
					<div>&nbsp;&nbsp;&nbsp;&nbsp;（4）设立严格的数据使用和访问制度，采用严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违规使用。</div>
					<div>&nbsp;&nbsp;&nbsp;&nbsp;（5）采取专门的数据和技术安全审计，设立日志审计和行为审计多项措施。</div>
					<div>2、保护个人信息采取的其他安全措施</div>
					<div>&nbsp;&nbsp;&nbsp;&nbsp;（1）通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用。</div>
					<div>&nbsp;&nbsp;&nbsp;&nbsp;（2）建立数据安全专项部门，负责安全应急响应组织，来推进和保障个人信息安全。</div>
					<div>&nbsp;&nbsp;&nbsp;&nbsp;（3）加强安全意识。我们还会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。</div>
					<div>3、个人信息安全事件的通知</div>
					<div>&nbsp;&nbsp;&nbsp;&nbsp;（1）如发生个人信息有关的安全事件，Hashii将第一时间向相应主管机关报备，并及时进行问题排查，开展应急措施。</div>
					<div>&nbsp;&nbsp;&nbsp;&nbsp;（2）向全量用户发送通知提醒更改密码，或通过电话、短信等各种方式触达用户知晓，并在Hashii公共运营平台运营宣传，制止数据泄露。</div>
					<div>4、尽管Hashii已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，用户仍应采取积极措施保证个人信息的安全，如：定期修改账号密码，不将自己的账号密码等个人信息透露给他人。</div>
					<div>
						5、<b>你知悉：Hashii提供的个人信息保护措施仅适用于Hashii，一旦你离开Hashii，浏览或使用其他网站、服务及内容资源，Hashii即没有能力及义务保护你在Hashii以外的网站提交的任何个人信息，无论你登录或浏览上述网站是否基于Hashii的链接或引导。</b>
					</div>
					<div>网络环境中始终存在各种信息泄漏的风险，当出现意外事件、不可抗力等情形导致你的信息出现泄漏时，Hashii将极力控制局面，及时告知你事件起因、Hashii采取的安全措施、你可以主动采取的安全措施等相关情况。</div>

				</p>

				<p>
					<b>五、个人信息的存储</b>
					<div>1、Hashii会采取合适的安全措施和技术手段存储及保护你的个人信息，以防止丢失、被误用、受到未授权访问或泄漏、被篡改或毁坏。你的个人信息存放在有密码控制的位于中国境内的服务器中，访问均是受到限制的。</div>
					<div> <b> 2、Hashii会依照个人信息的不同等级存储不同期限，存储期限严格按照法律及相关法规规定，最低期限不少于6个月。我们将会按照《网络安全法》规定的期限保存您的个人信息。超出法定保存期限后，我们会将您的个人信息删除或做匿名化处理。</b></div>
					<div> <b> 3、如果您终止使用“Hashii”软件及服务，我们将停止对您的信息的收集和使用，法律法规另有规定的除外。如果我们停止运营，我们将停止收集和使用您的个人信息。</b></div>
					<div>4、我们仅允许有必要知晓这些信息的Hashii员工等第三方访问个人信息，并要求他们履行相应的保密义务。</div>
					<div>5、我们在中华人民共和国境内运营中收集和产生的个人信息，将存储在中国境内。以下情形下，我们会在履行法律规定的义务后，向可能的境外实体提供您的个人信息：
						<div>（1）适用的法律有明确规定；</div>
						<div>（2）获得您的单独同意；</div>
						<div>（3）您作为一方当事人的跨境交易及其他类型合同订立和履行所必需的。</div>
						针对以上情形，我们会按照本政策依法保护您的个人信息安全。
					</div>
				</p>

				<p>
					<b>六、个人信息的共享、转让、公开披露</b>
					<div>1、我们会以高度的勤勉义务对待您的信息。除非经过您本人事先授权同意，我们不会向第三方共享、转让可识别的个人信息。我们可能共享、转让去标识化处理后的个人信息，且保证共享第三方无法重新识别此类信息的自然人主体。</div>
					<div>2、特定前提下，我们可能将您的个人信息与第三方共享，但我们只会共享必要的个人信息，且第三方受本政策中所声明目的的约束。我们将要求第三方对您的个人信息采取保护措施并且严格遵守相关法律法规与监管要求。第三方如要改变个人信息的处理目的，将再次征求您的授权同意。</div>
					<div>3、<b>您同意我们为实现特定功能，我们可能会与业务合作伙伴共享您的信息。</b> 我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。我们共享这些信息仅为实现本政策中声明的目的。例如，当第三方软件、设备系统与“Hashii”产品或服务结合为您提供基于位置的服务时，“Hashii”可能会基于您对系统定位的授权及设定，收集您的位置信息及设备信息（例如硬件型号、操作系统版本号、国际移动设备身份识别码（IMEI）、网络设备硬件地址（MAC）），并经过去标识化处理后提供给前述合作伙伴，特殊情境下还会包含您另行填写的联系信息。如您拒绝此类信息的收集及使用，您需要在设备系统中进行设置或关闭提供服务的软件，“Hashii”中无法自动或手动设置关闭相关服务。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。</div>
					<div>4、对我们与之共享个人信息的公司、组织和个人，我们会对其数据安全环境进行调查，与其签署严格的保密协定，要求他们按照我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。</div>
					<div>5、随着我们业务的持续发展，我们以及我们的关联公司有可能进行合并、收购、资产转让或类似的交易，您的个人信息有可能作为此类交易的一部分而被转移，我们将在转移前通知您，我们将按照法律法规及不低于本隐私政策所要求的标准继续保护或要求新的控制者继续保护您的个人信息。</div>
					<div>6、<b>未经您本人允许，我们不会向除公司及其关联方外的任何公司、组织和个人，共享、转让、公开披露您的个人信息，下列情形除外：</b> </div>
					<div>（1） 事先获得您的明确授权同意；</div>
					<div>（2） 您自行向第三方共享、转让、公开的；</div>
					<div>（3） 与国家安全、国防安全、公共安全、公共卫生、公共利益直接相关的；</div>
					<div>（4） 根据适用的法律法规、法律程序的要求、强制性的行政司法要求进行披露或提供，或对外提供的个人信息是与犯罪侦查、起诉、审判和判决执行等直接相关的。在前述情况下，我们会依据被要求提供或披露的个人信息类型和方式提供/披露您的个人信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求请求方必须出具相应的法律文件，如传票或调查函。我们将对所有的请求都进行审慎的审查，以确保其具备合法依据，且请求的数据仅限于行政、司法部门因特定调查目的有合法权利获取的数据；</div>
					<div>（5） 在法律法规允许的范围内，为维护“Hashii”用户、公司及其关联公司、控制公司的生命、财产等合法权益或维护产品或服务的安全稳定运行所必需的，例如查找、预防、处理欺诈等违法活动和减少信用风险等；不过这并不包括违反本政策中所做的承诺而为获利目的对外公开或提供个人信息；</div>
					<div>（6） 公司为维护合法权益而向用户提起诉讼或仲裁；</div>
					<div>（7） 在涉及合并、分立、收购、资产转让或类似的交易时，如涉及到个人信息转让，公司会要求新的持有您的个人信息的公司、组织继续受本隐私政策的约束，否则，公司有权要求该公司、组织重新取得您的授权同意；</div>
					<div>（8）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</div>
					<div>（9）为学术研究目的，或为学术研究机构，出于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；</div>
					<div>（10）法律法规规定的其他情形。</div>
					<div>
						<b>
							8、为保障Hashii的稳定运行、功能实现，使您能够使用和享受更多的服务及功能，我们的应用中会嵌入授权合作伙伴的SDK或其他类似的应用程序。我们会与授权合作伙伴约定严格的数据保护措施，要求他们按照本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。在个人敏感数据使用上，我们要求第三方采用数据脱敏和加密技术，从而更好地保护用户数据。
							我们接入的【第三方的SDK详情】如下：
							(1)SDK名称：
							(2)服务商名称：
							(3)使用目的：
							(4)信息类型：
							(5)SDK隐私政策链接：
						</b>
					</div>
				</p>


				<p>
					<b>七、个人信息的管理</b>
					<div>1、访问和更正您的个人信息。</div>

					<div>
						2、删除您的个人信息。
						<div>在以下情形中，您可以向我们提出删除个人信息的请求：</div>
						<div>（1）如果我们处理个人信息的行为违反法律法规；</div>
						<div>（2）如果我们收集、使用您的个人信息，却未征得您的同意；</div>
						<div>（3）如果我们处理个人信息的行为违反了与您的约定；</div>
						<div>（4）如果您不再使用我们的产品与服务，或您注销了账号；</div>
						<div>（5）如果我们不再为您提供产品或服务。</div>
						若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除。除非法律法规另有规定，或这些实体获得您的独立授权
					</div>

					<div>3、改变您授权同意的范围或撤回您的授权。</div>
					<div>4、您可以通过删除信息、关闭某项服务或功能、在软件中进行隐私设置、应用权限管理等方式改变您授权我们继续收集个人信息的范围或撤回您的授权。您也可以通过注销账号的方式，撤回我们继续收集您个人信息的全部授权。</div>
					<div>5、请您理解，每个业务功能需要一些基本的个人信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理。</div>

					<div>6、注销账号。</div>
				</p>

				<p>
					<b>八、如何处理未成年人的个人信息</b>
					<div><b>&nbsp;&nbsp;&nbsp;&nbsp;Hashii我们的产品及服务主要面向成年人。 如果您是未达法定成年年龄的未成年人，在使用我们的产品及服务前，应事先征得您的监护人（您的父母或法定监护人）同意。对于经监护人同意而收集的未成年人个人信息，我们只会在法律允许、监护人明确同意或者保护未成年人所必要的情况下使用或披露。</b></div>
					<div><b>&nbsp;&nbsp;&nbsp;&nbsp;如果有事实证明未成年人并未取得监护人同意的情况下注册使用了我们的产品及服务，我们会尽快删除相关个人信息。</b></div>
					<div><b>&nbsp;&nbsp;&nbsp;&nbsp;如果监护人有理由相信未成年人未经事先同意而向我们提交了个人信息，请尽快联系我们处理以避免不必要的损失或影响。</b></div>
				</p>

				<p>
					<b>九、隐私政策的修改</b>
					<div>1、为给你提供更好的服务以及随着我们业务的发展，本政策也会随之更新。但未经你明确同意，我们不会削减你依据当前生效隐私政策所应享有的权利。</div>
					<div><b>我们会在网站、移动端上发出更新版本并在生效前通过适当方式提醒你相关内容的更新，以便你及时了解最新的隐私政策。</b></div>
					<div>2、对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信、私信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。</div>
					<div>3、本政策所指的重大变更包括但不限于：</div>
					<div>（1）我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；</div>
					<div>（2）我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；</div>
					<div>（3）个人信息共享、转让或公开披露的主要对象发生变化；</div>
					<div>（4）你参与个人信息处理方面的权利及其行使方式发生重大变化；</div>
					<div>（5）我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</div>
					<div>（6）个人信息安全影响评估报告表明存在高风险时。</div>
				</p>

				<p>
					<b>十、争议解决</b>
					<b>当你因为本政策的实施与Hashii产生任何纠纷时，双方应首先协商友好解决；若不能协商解决，双方有权依照被告住所地向有管辖权的法院提起诉讼。</b>
				</p>

				<p>
					<b>十一、如何联系我们</b>
					<div>1、如果你对本隐私政策有任何疑问，请你通过以下方式与我们联系，<b>我们将在15天内回复您的请求：</b></div>
					联系方式：contact@stars-mine.com
				</p>
			</div>
		</div>

	}
}

export default Agreement;